// Тестовые вопросы:
// 1. Найти минимальное число в массиве [готово]
// 1.1 Найти максимальное число в массиве [готово]
// 2. Из массива вычленить только уникальные значения [готово]
// 3. Из массива вычленить только не уникальные значения [готово]
// 4. Обойти дерево (простое и бинарное)
// 5. Обойти связанный список
// 6. Найти среднее арифметическое из массива чисел [готово]
// 7. Решить задачу на валидацию последовательности скобок https://leetcode.com/problems/valid-parentheses
// 8. Решить задачу на палиндром https://leetcode.com/problems/valid-palindrome/
// 9. Найти в массиве четные числа [готово]
// Структуры!

package main
